const Discord = require('discord.js');
const client = new Discord.Client();
console.log("Scrpit By Dream");


client.on("ready", () => {
let channel =     client.channels.get("674344875977867264")
setInterval(function() {
channel.send(`سبحانك اللهم وبحمدك اشهد ان لا اله الا انت استغفرك واتوب اليك استودعك الله دينك واماناتك وخواتيم اعمالك والسلام عليكم ورحمة الله وبركاته سبحانك اللهم وبحمدك اشهد ان لا اله الا انت استغفرك واتوب اليك استودعك الله دينك واماناتك وخواتيم اعمالك والسلام عليكم ورحمة الله وبركاته سبحانك اللهم وبحمدك اشهد ان لا اله الا انت استغفرك واتوب اليك استودعك الله دينك واماناتك وخواتيم اعمالك والسلام عليكم ورحمة الله وبركاته`);
}, 30)
})

client.login(process.env.BOT_TOKEN);